zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_MRCC.h
/*! @name MRCC_GPIOB_CLKSEL - GPIOB clock selection control */
/*! @{ */

#define MRCC_MRCC_GPIOB_CLKSEL_CC_MASK           (0x30U)
#define MRCC_MRCC_GPIOB_CLKSEL_CC_SHIFT          (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_GPIOB_CLKSEL_CC(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOB_CLKSEL_CC_SHIFT)) & MRCC_MRCC_GPIOB_CLKSEL_CC_MASK)

#define MRCC_MRCC_GPIOB_CLKSEL_RSTB_MASK         (0x40000000U)
#define MRCC_MRCC_GPIOB_CLKSEL_RSTB_SHIFT        (30U)
/*! RSTB - Reset Negation
 *  0b0..Module is held in reset
 *  0b1..Module released from reset
 */
#define MRCC_MRCC_GPIOB_CLKSEL_RSTB(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOB_CLKSEL_RSTB_SHIFT)) & MRCC_MRCC_GPIOB_CLKSEL_RSTB_MASK)

#define MRCC_MRCC_GPIOB_CLKSEL_PR_MASK           (0x80000000U)
#define MRCC_MRCC_GPIOB_CLKSEL_PR_SHIFT          (31U)
/*! PR - Peripheral Present
 *  0b0..Module is not present; writes to this register are ignored
 *  0b1..Module is present
 */
#define MRCC_MRCC_GPIOB_CLKSEL_PR(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOB_CLKSEL_PR_SHIFT)) & MRCC_MRCC_GPIOB_CLKSEL_PR_MASK)
/*! @} */

/*! @name MRCC_GPIOC_CLKSEL - GPIOC clock selection control */
/*! @{ */

#define MRCC_MRCC_GPIOC_CLKSEL_CC_MASK           (0x30U)
#define MRCC_MRCC_GPIOC_CLKSEL_CC_SHIFT          (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_GPIOC_CLKSEL_CC(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOC_CLKSEL_CC_SHIFT)) & MRCC_MRCC_GPIOC_CLKSEL_CC_MASK)

#define MRCC_MRCC_GPIOC_CLKSEL_RSTB_MASK         (0x40000000U)
#define MRCC_MRCC_GPIOC_CLKSEL_RSTB_SHIFT        (30U)
/*! RSTB - Reset Negation
 *  0b0..Module is held in reset
 *  0b1..Module released from reset
 */
#define MRCC_MRCC_GPIOC_CLKSEL_RSTB(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOC_CLKSEL_RSTB_SHIFT)) & MRCC_MRCC_GPIOC_CLKSEL_RSTB_MASK)

#define MRCC_MRCC_GPIOC_CLKSEL_PR_MASK           (0x80000000U)
#define MRCC_MRCC_GPIOC_CLKSEL_PR_SHIFT          (31U)
/*! PR - Peripheral Present
 *  0b0..Module is not present; writes to this register are ignored
 *  0b1..Module is present
 */
#define MRCC_MRCC_GPIOC_CLKSEL_PR(x)             (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_GPIOC_CLKSEL_PR_SHIFT)) & MRCC_MRCC_GPIOC_CLKSEL_PR_MASK)
/*! @} */

/*! @name MRCC_INTM_CLKSEL - INTM clock selection control */
/*! @{ */

#define MRCC_MRCC_INTM_CLKSEL_CC_MASK            (0x30U)
#define MRCC_MRCC_INTM_CLKSEL_CC_SHIFT           (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_INTM_CLKSEL_CC(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_INTM_CLKSEL_CC_SHIFT)) & MRCC_MRCC_INTM_CLKSEL_CC_MASK)

#define MRCC_MRCC_INTM_CLKSEL_RSTB_MASK          (0x40000000U)
#define MRCC_MRCC_INTM_CLKSEL_RSTB_SHIFT         (30U)
/*! RSTB - Reset Negation
 *  0b0..Module is held in reset
 *  0b1..Module released from reset
 */
#define MRCC_MRCC_INTM_CLKSEL_RSTB(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_INTM_CLKSEL_RSTB_SHIFT)) & MRCC_MRCC_INTM_CLKSEL_RSTB_MASK)

#define MRCC_MRCC_INTM_CLKSEL_PR_MASK            (0x80000000U)
#define MRCC_MRCC_INTM_CLKSEL_PR_SHIFT           (31U)
/*! PR - Peripheral Present
 *  0b0..Module is not present; writes to this register are ignored
 *  0b1..Module is present
 */
#define MRCC_MRCC_INTM_CLKSEL_PR(x)              (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_INTM_CLKSEL_PR_SHIFT)) & MRCC_MRCC_INTM_CLKSEL_PR_MASK)
/*! @} */

/*! @name MRCC_IPSYNC_TRNG0_CLKSEL - IPSYNC_TRNG0 clock selection control */
/*! @{ */

#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_CC_MASK    (0x30U)
#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_CC_SHIFT   (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_CC(x)      (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_CC_SHIFT)) & MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_CC_MASK)

#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_RSTB_MASK  (0x40000000U)
#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_RSTB_SHIFT (30U)
/*! RSTB - Reset Negation
 *  0b0..Module is held in reset
 *  0b1..Module released from reset
 */
#define MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_RSTB(x)    (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_RSTB_SHIFT)) & MRCC_MRCC_IPSYNC_TRNG0_CLKSEL_RSTB_MASK)

