zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_MRCC.h
/*! @name MRCC_LPSPI2_CLKDIV - LPSPI2 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPSPI2_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPSPI2_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPSPI2_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_HALT_MASK)

#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_MASK      (0x80000000U)
#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..clock frequency isn't stable
 */
#define MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_LPSPI2_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPTMR0_CLKSEL - LPTMR0 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPTMR0_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPTMR0_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..Reserved
 *  0b001..FRO_HF_DIV
 *  0b010..CLK_IN
 *  0b111..THE CLOCK IS OFF
 */
#define MRCC_MRCC_LPTMR0_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPTMR0_CLKSEL_MUX_MASK)

#define MRCC_MRCC_LPTMR0_CLKSEL_CC_MASK          (0x30U)
#define MRCC_MRCC_LPTMR0_CLKSEL_CC_SHIFT         (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_LPTMR0_CLKSEL_CC(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKSEL_CC_SHIFT)) & MRCC_MRCC_LPTMR0_CLKSEL_CC_MASK)

#define MRCC_MRCC_LPTMR0_CLKSEL_RSTB_MASK        (0x40000000U)
#define MRCC_MRCC_LPTMR0_CLKSEL_RSTB_SHIFT       (30U)
/*! RSTB - Reset Negation
 *  0b0..Module is held in reset
 *  0b1..Module released from reset
 */
#define MRCC_MRCC_LPTMR0_CLKSEL_RSTB(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKSEL_RSTB_SHIFT)) & MRCC_MRCC_LPTMR0_CLKSEL_RSTB_MASK)

#define MRCC_MRCC_LPTMR0_CLKSEL_PR_MASK          (0x80000000U)
#define MRCC_MRCC_LPTMR0_CLKSEL_PR_SHIFT         (31U)
/*! PR - Peripheral Present
 *  0b0..Module is not present; writes to this register are ignored
 *  0b1..Module is present
 */
#define MRCC_MRCC_LPTMR0_CLKSEL_PR(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKSEL_PR_SHIFT)) & MRCC_MRCC_LPTMR0_CLKSEL_PR_MASK)
/*! @} */

/*! @name MRCC_LPTMR0_CLKDIV - LPTMR0 clock divider control */
/*! @{ */

#define MRCC_MRCC_LPTMR0_CLKDIV_DIV_MASK         (0xFU)
#define MRCC_MRCC_LPTMR0_CLKDIV_DIV_SHIFT        (0U)
/*! DIV - Functional Clock Divider */
#define MRCC_MRCC_LPTMR0_CLKDIV_DIV(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKDIV_DIV_SHIFT)) & MRCC_MRCC_LPTMR0_CLKDIV_DIV_MASK)

#define MRCC_MRCC_LPTMR0_CLKDIV_RESET_MASK       (0x20000000U)
#define MRCC_MRCC_LPTMR0_CLKDIV_RESET_SHIFT      (29U)
/*! RESET - Reset divider counter
 *  0b0..Divider isn't reset
 *  0b1..Divider is reset
 */
#define MRCC_MRCC_LPTMR0_CLKDIV_RESET(x)         (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKDIV_RESET_SHIFT)) & MRCC_MRCC_LPTMR0_CLKDIV_RESET_MASK)

#define MRCC_MRCC_LPTMR0_CLKDIV_HALT_MASK        (0x40000000U)
#define MRCC_MRCC_LPTMR0_CLKDIV_HALT_SHIFT       (30U)
/*! HALT - Halt divider counter
 *  0b0..Divider clock is running
 *  0b1..Divider clock is stopped
 */
#define MRCC_MRCC_LPTMR0_CLKDIV_HALT(x)          (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKDIV_HALT_SHIFT)) & MRCC_MRCC_LPTMR0_CLKDIV_HALT_MASK)

#define MRCC_MRCC_LPTMR0_CLKDIV_UNSTAB_MASK      (0x80000000U)
#define MRCC_MRCC_LPTMR0_CLKDIV_UNSTAB_SHIFT     (31U)
/*! UNSTAB - Divider status flag
 *  0b0..Divider clock is stable
 *  0b1..clock frequency isn't stable
 */
#define MRCC_MRCC_LPTMR0_CLKDIV_UNSTAB(x)        (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR0_CLKDIV_UNSTAB_SHIFT)) & MRCC_MRCC_LPTMR0_CLKDIV_UNSTAB_MASK)
/*! @} */

/*! @name MRCC_LPTMR1_CLKSEL - LPTMR1 clock selection control */
/*! @{ */

#define MRCC_MRCC_LPTMR1_CLKSEL_MUX_MASK         (0x7U)
#define MRCC_MRCC_LPTMR1_CLKSEL_MUX_SHIFT        (0U)
/*! MUX - Functional Clock Mux Select
 *  0b000..Reserved
 *  0b001..FRO_HF_DIV
 *  0b010..CLK_IN
 *  0b111..THE CLOCK IS OFF
 */
#define MRCC_MRCC_LPTMR1_CLKSEL_MUX(x)           (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR1_CLKSEL_MUX_SHIFT)) & MRCC_MRCC_LPTMR1_CLKSEL_MUX_MASK)

#define MRCC_MRCC_LPTMR1_CLKSEL_CC_MASK          (0x30U)
#define MRCC_MRCC_LPTMR1_CLKSEL_CC_SHIFT         (4U)
/*! CC - Clock Configuration
 *  0b00..Peripheral clocks are disabled; module does not stall low power mode entry
 *  0b01..Peripheral clocks are enabled; module does not stall low power mode entry
 *  0b10..Peripheral clocks are enabled unless module is idle; low power mode entry stalls until module is idle
 *  0b11..Peripheral clocks are enabled unless in SLEEP (or lower) mode; low power mode entry stalls until module
 *        is idle. Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low
 *        power mode entry unless entering DEEPSLEEP (or lower) mode
 */
#define MRCC_MRCC_LPTMR1_CLKSEL_CC(x)            (((uint32_t)(((uint32_t)(x)) << MRCC_MRCC_LPTMR1_CLKSEL_CC_SHIFT)) & MRCC_MRCC_LPTMR1_CLKSEL_CC_MASK)

